// Source
// Emoticons: https://en.wikipedia.org/wiki/List_of_emoticons
//https://wprock.fr/en/blog/kaomoji-emoji-smiley-ascii-art/#:~:text=Find%20a%20list%20of%20more,in%20Japan%20in%20the%201990s

var EMOTICONS = [
  {
    emoteList: [':)', ':o)', ':‑D', ':(', ':‑(', ':‑c', ';)', 'XD'],
    category: ':)'
  },
  {
    emoteList: [
      '¯\\_(ツ)_/¯', '\^o^/', '(*>﹏<*)', '′(*^▽^*)', '（*＾-＾*）',
      '(*^_^*)', 'o(*^＠^*)o', '～( •̀ ω •́ )', '~(￣▽￣)~', 'o(*^＠^*)o', '§(*￣▽￣*)§'
    ],
    category: '¯\\_(ツ)_/¯'
  },
  {
    emoteList: [
      '>^_^<','<^!^>','^/^','（*^_^*）','§^.^§','(^<^)','(^.^)',
      '(^ム^)','(^·^)','(^.^)','(^_^.)','(^_^)','(^^)','(^J^)',
      '(*^.^*)','^_^','(#^.^#)','（^—^）'
    ],
    category: '>^_^<'
  },
  {
    emoteList: [
      '°o°', 'o_O', 'o_0', 'o.O', '(o.o)', 'oO'
    ],
    category: '°o°'
  },
  {
    emoteList: [
      '(╯°□°）╯︵ ┻━┻', '┬──┬¯\_(ツ)', '┻━┻︵ヽ(`Д´)ﾉ︵ ┻━┻',
      '┬─┬ノ( º _ ºノ)', '(ノಠ益ಠ)ノ彡┻━┻'
    ],
    category: '(╯°□°）╯︵ ┻━┻'
  },
  {
    emoteList: [
      'ヾ(≧▽≦*)o', 'q(≧▽≦q)', '(≧ロ≦)', '(╬ ಠ益ಠ)',
      '(ΘεΘ;)', 'ヽ(ｏ`皿′ｏ)ﾉ', '' 
    ],
    category: 'ヾ(≧▽≦*)o'
  },
  {
    emoteList: [
      'ʕ•ᴥ•ʔ ', 'ʕᵔᴥᵔʔ ', 'ʕ •`ᴥ•´ʔ ', 'ʕ •́؈•̀ ₎ ', '(`･ω･´) ',
      'ᵒᴥᵒ ', 'V•ᴥ•V ', 'ฅ^•ﻌ•^ฅ ', '( ఠൠఠ )ﾉ ', 'ʕʘ̅͜ʘ̅ʔ ', 'ح˚௰˚づ '
    ],
    category: 'ʕ•ᴥ•ʔ'
  },
  {
    emoteList: [
     '（ ^_^）o自自o（^_^ ） ', '༼∵༽ ༼⍨༽ ༼⍢༽ ༼⍤༽ ', 'ヽ༼ ಠ益ಠ ༽ﾉ ',
     '乁( ◔ ౪◔)「 ┑(￣Д ￣)┍ ', '(∩｀-´)⊃━☆ﾟ.*･｡ﾟ ', 'ε=ε=ε=┌(;*´Д`)ﾉ ', '-`ღ´- '
    ],
    category: '（ ^_^）o自自o（^_^ ） '
  }
]
