// Source
// Emoticons: https://en.wikipedia.org/wiki/List_of_emoticons
// https://wprock.fr/en/blog/kaomoji-emoji-smiley-ascii-art/#:~:text=Find%20a%20list%20of%20more,in%20Japan%20in%20the%201990s
// Some are custom made from our side,and some are from old Japanese archives.
// If any kaomoji maker finds their custom made kaomoji without being given due credit,please do contact us.
// We are strictly against plagiarism.

//https://www.compart.com/en/unicode/block/U+2600


var EMOTICONS = [
  {
    emoteList: [
      '« »', '“ ”','‘ ’','·','—','–','€','₯','ϑ','ϖ','𝜋','«','»','ϗ','Ϗ','ϛ','Ϛ','ȣ','Ȣ','ϐ',''
    ],
    category: 'gr'
  },
  {
    emoteList: [
      '†', '‡','©','®','✔','°','℃','℉','±','÷','§','¦','¬','µ','¶','ø','¤','£','¢','¡','²','³'
    ],
    category: 'other'
  },
  {
    emoteList: [
      'Ⅰ', 'Ⅱ', 'Ⅲ', 'Ⅳ', 'Ⅴ', 'Ⅵ', 'Ⅶ', 'Ⅷ', 'Ⅸ', 'Ⅹ', 'Ⅺ', 'Ⅻ','Ⅼ','Ⅽ','Ⅾ','Ⅿ'
    ],
    category: 'numerals'
  },
  {
    emoteList: [
      '½','⅓','⅔','¼','¾','⅕','⅖','⅗','⅘','⅙','⅚'
    ],
    category: 'fractions'
  },
  {
    emoteList: [
      '☠', '☢', '☣', '☮', '☯', '♿','☤', '⚕', '⛨', '⚠', '⚡', '⛐'
    ],
    category: 'Health and safety'
  },
 
  {
    emoteList: [
      '🎵','🎶','♪','♫','♬','♩','♯','♮','♭'
    ],
    category: 'music'
  },
 
   {
    emoteList: [
                  '·','•','●','⚫','‣','∎','■','◼','◾','▪','‘','’','‚','“','”','„','›','‹','«','»',    
    ],
    category: 'bullets'
  },

 {
    emoteList: [
                  '←','↑','→','↓','↔','↕','↖','↗','↘','↙','⇐','⇑','⇒','⇓','⇔','⇕','⇖','⇗','⇘','⇙',    
    ],
    category: 'arrows1'
  },

  {
    emoteList: [
      '⬆️','↗️','➡️','↘️','⬇️','↙️','⬅️','↖️','↕️','↔️','↩️','↪️', '⤴️', '⤵️', '🔃', '🔄', '🔙', '🔚', '🔛', '🔜', '🔝'
    ],
    category: 'arrows2'
  },

  {
    emoteList: [
			'⁰','ⁱ','¹','²','³','⁴','⁵','⁶','⁷','⁸','⁹','⁺','⁻','⁼','⁽','⁾','ⁿ','₀','₁','₂','₃','₄','₅','₆','₇','₈','₉','₊','₋','₌','₍','₎'
    ],
    category: 'superscripts subscripts'
  },
  
  // {
  //   emoteList: [
  //                 '∀','∴','∃','∵','±','∓','×','⋅','÷','∕','√','∛','∜','∂','∫','∴','∞','⊕','⊗','∗','⋆','∠','∡','∢','∇','∆','',
  //   ],
  //   category: 'math'
  // },

  {
    emoteList: [
                  '∀','∴','∃','∵','±','∓','×','⋅','÷','∕','√','∛','∜','∂','∫','∴','∞','⊕','⊗','∗','⋆','∠','∡','∢','∇','∆','∝','∼','≈','≃','≤','≲','≳','≥','≠','≪','≫','≅','≡','≘','≙','≟','≷','≕','≔','',
    ],
    category: 'math'
  },

  {
    emoteList: [
                  'é','â','ê','î','ô','û','à','è','ù','ë','ï','ç','É','Â','Î','Ô','Û','À','È','Ù','Ë','Ï','Ç','',
    ],
    category: 'tonoi'
  },


  {
    emoteList: [ 
		'♁','♂','☺','☯','☮','☘','☐','☑','☒','☏','☎','♺','⚓','⛾','☕'
    ],
    category: 'misc'
  },
  

  {
    emoteList: [
                  '℀','℁','ℂ','℃','℄','℅','℆','ℇ','℈','℉','ℊ','ℋ','ℌ','ℍ','ℎ','ℏ','ℐ','ℑ','ℒ','ℓ','℔','ℕ','№','℗','℘','ℙ','ℚ','ℛ','ℜ','ℝ','℞','℟','℠','℡','™','℣','ℤ','℥','Ω','℧','ℨ','℩','K','Å','ℬ','ℭ','℮','ℯ','ℰ','ℱ','Ⅎ','ℳ','ℴ','ℵ','ℶ','ℷ','ℸ','ℹ','℺','℻','ℼ','ℽ','ℾ','ℿ','⅀','⅁','⅂','⅃','⅄','ⅅ','ⅆ','ⅇ','ⅈ','ⅉ','⅊','⅋','⅌','⅍','ⅎ','⅏'
    ],
    category: 'Letterlike'
  },


 {
    emoteList: [
      '😀', '😉', '😎', '😍', '🤔', '👍','👀','😇','✔️','❤️','💘','💯','💤','⛔','🛑','⚠️','💬','🔔','🎵','🎶'
    ],
      category: 'emoji'
  },

  {
    emoteList: [
      ':)', ':o)', ':‑D', ':(', ':‑(', ':‑c', ';)', ':]'
    ],
    category: ':)'
  }



]
